----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  M:\Blackman\PropensityScoreMatching\PropensityScoreMatching\tests\results\all_results.log
  log type:  text
 opened on:   3 Dec 2015, 17:54:20

. 
. use "nsw_all.dta", clear

. set seed 12345

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. keep if _n <= 10
(435 observations deleted)

. export delimited using "nsw_all_minimal.csv", replace
file nsw_all_minimal.csv saved

. 
. use "nsw_all.dta", clear

. set seed 12345

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random1.csv", replace
file nsw_all_random1.csv saved

. 
. use "nsw_all.dta", clear

. set seed 42

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random2.csv", replace
file nsw_all_random2.csv saved

. 
. use "nsw_all.dta", clear

. set seed 35456321

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random3.csv", replace
file nsw_all_random3.csv saved

. 
. 
. *Export test data sets for simple propensity score regression
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =         10
                                                  LR chi2(1)      =       3.47
                                                  Prob > chi2     =     0.0624
Log likelihood = -4.9939881                       Pseudo R2       =     0.2580

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1493676   .1074041     1.39   0.164    -.0611406    .3598757
       _cons |  -4.403282   2.820861    -1.56   0.119    -9.932068    1.125504
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5596.33138  -1013.23531   5311.91113    -0.19
                        ATT | 4583.09607   3385.81104   1197.28503   4982.86793     0.24
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         6 |         6 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |        10 |        10 


. export delimited using "nsw_all_minimal_pscoresimple.csv", replace
file nsw_all_minimal_pscoresimple.csv saved

. 
. import delimited "nsw_all_random1.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230282   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   5341.43016   1007.71335   1539.47529     0.65
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random1_pscoresimple.csv", replace
file nsw_all_random1_pscoresimple.csv saved

. 
. import delimited "nsw_all_random2.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230281   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3397.68807   2951.45543     1122.193     2.63
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random2_pscoresimple.csv", replace
file nsw_all_random2_pscoresimple.csv saved

. 
. import delimited "nsw_all_random3.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230282   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   4148.65249   2200.49101    1314.9829     1.67
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random3_pscoresimple.csv", replace
file nsw_all_random3_pscoresimple.csv saved

. 
. 
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age Education, outcome(RE78) logit

Logistic regression                               Number of obs   =         10
                                                  LR chi2(2)      =       3.58
                                                  Prob > chi2     =     0.1671
Log likelihood =  -4.940793                       Pseudo R2       =     0.2659

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1487288   .1074076     1.38   0.166    -.0617863    .3592439
   Education |   .1676756   .5175116     0.32   0.746    -.8466284     1.18198
       _cons |  -6.102286    6.17208    -0.99   0.323    -18.19934    5.994769
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5596.33138  -1013.23531   5311.91113    -0.19
                        ATT | 4583.09607   5676.13629  -1093.04022   5009.74651    -0.22
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         6 |         6 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |        10 |        10 


. export delimited using "nsw_all_minimal_pscore_age_education.csv", replace
(note: file nsw_all_minimal_pscore_age_education.csv not found)
file nsw_all_minimal_pscore_age_education.csv saved

. 
. 
. *Export test data sets for extensive propensity score regression
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit
note: Black != 1 predicts failure perfectly
      Black dropped and 1 obs not used

note: Hispanic omitted because of collinearity
note: Married omitted because of collinearity

Logistic regression                               Number of obs   =          9
                                                  LR chi2(3)      =       4.22
                                                  Prob > chi2     =     0.2382
Log likelihood = -4.0705415                       Pseudo R2       =     0.3416

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1656105   .1489175     1.11   0.266    -.1262625    .4574835
   Education |  -.1910432   1.342356    -0.14   0.887    -2.822013    2.439926
       Black |          0  (omitted)
    Hispanic |          0  (omitted)
     Married |          0  (omitted)
    Nodegree |  -1.790412   4.447845    -0.40   0.687    -10.50803    6.927204
       _cons |  -1.385701   17.57202    -0.08   0.937    -35.82623    33.05483
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5361.27324  -778.177173   5892.41387    -0.13
                        ATT | 4583.09607   16267.2518  -11684.1557   11228.9762    -1.04
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         5 |         5 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |         9 |         9 


. export delimited using "nsw_all_minimal_pscorefull.csv", replace
file nsw_all_minimal_pscorefull.csv saved

. 
. import delimited "nsw_all_random1.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   4206.42107   2142.72243   849.725581     2.52
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random1_pscorefull.csv", replace
file nsw_all_random1_pscorefull.csv saved

. 
. import delimited "nsw_all_random2.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3156.51283   3192.63067   803.308262     3.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random2_pscorefull.csv", replace
file nsw_all_random2_pscorefull.csv saved

. 
. import delimited "nsw_all_random3.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3306.96557   3042.17793   808.067411     3.76
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. export delimited using "nsw_all_random3_pscorefull.csv", replace
file nsw_all_random3_pscorefull.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  M:\Blackman\PropensityScoreMatching\PropensityScoreMatching\tests\results\all_results.log
  log type:  text
 closed on:   3 Dec 2015, 17:54:22
----------------------------------------------------------------------------------------------------------------------------------
