----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  M:\Blackman\PropensityScoreMatching\PropensityScoreMatching\tests\results\all_results.log
  log type:  text
 opened on:   4 Dec 2015, 13:25:09

. 
. use "nsw_all.dta", clear

. set seed 12345

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. keep if _n <= 10
(435 observations deleted)

. export delimited using "nsw_all_minimal.csv", replace
file nsw_all_minimal.csv saved

. 
. use "nsw_all.dta", clear

. set seed 12345

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random1.csv", replace
file nsw_all_random1.csv saved

. 
. use "nsw_all.dta", clear

. set seed 42

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random2.csv", replace
file nsw_all_random2.csv saved

. 
. use "nsw_all.dta", clear

. set seed 35456321

. gen sortorder = runiform()

. sort sortorder

. drop sortorder

. export delimited using "nsw_all_random3.csv", replace
file nsw_all_random3.csv saved

. 
. 
. *Export test data sets for simple propensity score regression
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =         10
                                                  LR chi2(1)      =       3.47
                                                  Prob > chi2     =     0.0624
Log likelihood = -4.9939881                       Pseudo R2       =     0.2580

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1493676   .1074041     1.39   0.164    -.0611406    .3598757
       _cons |  -4.403282   2.820861    -1.56   0.119    -9.932068    1.125504
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5596.33138  -1013.23531   5311.91113    -0.19
                        ATT | 4583.09607   3385.81104   1197.28503   4982.86793     0.24
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         6 |         6 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |        10 |        10 


. pstest Age, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  |     34     22.5    111.0         |   1.94  0.089 | 11.86
                       M  |     34    24.75     89.3    19.6 |   1.26  0.255 | 10.85
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.06; 15.44] for U and [0.06; 15.44] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.261      3.51    0.061    111.0     111.0     111.0*  11.86*     0
 Matched   | 0.168      1.87    0.172     89.3      89.3      89.0*  10.85*     0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_minimal_pscoresimple.csv", replace
file nsw_all_minimal_pscoresimple.csv saved

. 
. import delimited "nsw_all_random1.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230282   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   5341.43016   1007.71335   1539.47529     0.65
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816     25.8      0.2    97.9 |   0.02  0.983 |  1.01
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.002      1.25    0.264     10.7      10.7      10.7    1.03      0
 Matched   | 0.000      0.00    0.983      0.2       0.2       0.2    1.01      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random1_pscoresimple.csv", replace
file nsw_all_random1_pscoresimple.csv saved

. 
. import delimited "nsw_all_random2.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230281   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3397.68807   2951.45543     1122.193     2.63
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816     25.8      0.2    97.9 |   0.02  0.983 |  1.01
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.002      1.25    0.264     10.7      10.7      10.7    1.03      0
 Matched   | 0.000      0.00    0.983      0.2       0.2       0.2    1.01      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random2_pscoresimple.csv", replace
file nsw_all_random2_pscoresimple.csv saved

. 
. import delimited "nsw_all_random3.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(1)      =       1.24
                                                  Prob > chi2     =     0.2650
Log likelihood = -301.47888                       Pseudo R2       =     0.0021

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0150513   .0134977     1.12   0.265    -.0114038    .0415064
       _cons |  -.7230282   .3570777    -2.02   0.043    -1.422888   -.0231686
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   4148.65249   2200.49101    1314.9829     1.67
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816     25.8      0.2    97.9 |   0.02  0.983 |  1.01
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.002      1.25    0.264     10.7      10.7      10.7    1.03      0
 Matched   | 0.000      0.00    0.983      0.2       0.2       0.2    1.01      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random3_pscoresimple.csv", replace
file nsw_all_random3_pscoresimple.csv saved

. 
. 
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age Education, outcome(RE78) logit

Logistic regression                               Number of obs   =         10
                                                  LR chi2(2)      =       3.58
                                                  Prob > chi2     =     0.1671
Log likelihood =  -4.940793                       Pseudo R2       =     0.2659

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1487288   .1074076     1.38   0.166    -.0617863    .3592439
   Education |   .1676756   .5175116     0.32   0.746    -.8466284     1.18198
       _cons |  -6.102286    6.17208    -0.99   0.323    -18.19934    5.994769
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5596.33138  -1013.23531   5311.91113    -0.19
                        ATT | 4583.09607   5676.13629  -1093.04022   5009.74651    -0.22
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         6 |         6 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |        10 |        10 


. pstest Age Education, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  |     34     22.5    111.0         |   1.94  0.089 | 11.86
                       M  |     34     25.5     82.0    26.1 |   1.14  0.298 |  7.92
                          |                                  |               |
Education              U  |   10.5       10     25.5         |   0.42  0.684 |  2.83
                       M  |   10.5     10.5      0.0   100.0 |   0.00  1.000 |  5.67
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.06; 15.44] for U and [0.06; 15.44] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.266      3.58    0.167     68.3      68.3     112.5*  11.83*     0
 Matched   | 0.150      1.66    0.436     41.0      41.0      82.0*  18.37*     0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_minimal_pscore_age_education.csv", replace
file nsw_all_minimal_pscore_age_education.csv saved

. 
. 
. *Export test data sets for extensive propensity score regression
. import delimited "nsw_all_minimal.csv", case(preserve) clear
(10 vars, 10 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit
note: Black != 1 predicts failure perfectly
      Black dropped and 1 obs not used

note: Hispanic omitted because of collinearity
note: Married omitted because of collinearity

Logistic regression                               Number of obs   =          9
                                                  LR chi2(3)      =       4.22
                                                  Prob > chi2     =     0.2382
Log likelihood = -4.0705415                       Pseudo R2       =     0.3416

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .1656105   .1489175     1.11   0.266    -.1262625    .4574835
   Education |  -.1910432   1.342356    -0.14   0.887    -2.822013    2.439926
       Black |          0  (omitted)
    Hispanic |          0  (omitted)
     Married |          0  (omitted)
    Nodegree |  -1.790412   4.447845    -0.40   0.687    -10.50803    6.927204
       _cons |  -1.385701   17.57202    -0.08   0.937    -35.82623    33.05483
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 4583.09607   5361.27324  -778.177173   5892.41387    -0.13
                        ATT | 4583.09607   16267.2518  -11684.1557   11228.9762    -1.04
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |         5 |         5 
   Treated |         4 |         4 
-----------+-----------+----------
     Total |         9 |         9 


. pstest Age Education Black Hispanic Married Nodegree, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  |     34     21.4    123.0         |   1.96  0.090 | 16.78*
                       M  |     34     19.5    141.6   -15.1 |   2.06  0.086 |198.00*
                          |                                  |               |
Education              U  |   10.5      9.8     35.3         |   0.54  0.604 |  2.58
                       M  |   10.5    11.25    -37.8    -7.1 |  -0.53  0.613 |  2.52
                          |                                  |               |
Black                  U  |      1        1        .         |      .      . |     .
                       M  |      1        1        .       . |      .      . |     .
                          |                                  |               |
Hispanic               U  |      0        0        .         |      .      . |     .
                       M  |      0        0        .       . |      .      . |     .
                          |                                  |               |
Married                U  |      0        0        .         |      .      . |     .
                       M  |      0        0        .       . |      .      . |     .
                          |                                  |               |
Nodegree               U  |     .5       .8    -58.1         |  -0.88  0.407 |     .
                       M  |     .5      .25     48.4    16.7 |   0.65  0.537 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.06; 15.44] for U and [0.06; 15.44] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.342      4.23    0.238     72.1      58.1     135.8*   9.09*    50
 Matched   | 1.000     11.09        .     75.9      48.4     154.8*  237.67*   50
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_minimal_pscorefull.csv", replace
file nsw_all_minimal_pscorefull.csv saved

. 
. import delimited "nsw_all_random1.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   4206.42107   2142.72243   849.725581     2.52
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age Education Black Hispanic Married Nodegree, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816   25.497      4.5    58.2 |   0.43  0.670 |  0.98
                          |                                  |               |
Education              U  | 10.346   10.088     14.1         |   1.50  0.135 |  1.55*
                       M  | 10.346   10.303      2.4    83.2 |   0.21  0.832 |  1.13
                          |                                  |               |
Black                  U  | .84324   .82692      4.4         |   0.45  0.649 |     .
                       M  | .84324   .87568     -8.7   -98.7 |  -0.90  0.371 |     .
                          |                                  |               |
Hispanic               U  | .05946   .10769    -17.5         |  -1.78  0.076 |     .
                       M  | .05946   .06486     -2.0    88.8 |  -0.21  0.830 |     .
                          |                                  |               |
Married                U  | .18919   .15385      9.4         |   0.98  0.327 |     .
                       M  | .18919   .21622     -7.2    23.5 |  -0.65  0.519 |     .
                          |                                  |               |
Nodegree               U  | .70811   .83462    -30.4         |  -3.22  0.001 |     .
                       M  | .70811    .7027      1.3    95.7 |   0.11  0.910 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.024     14.79    0.022     14.4      12.4      37.2*   1.11     50
 Matched   | 0.006      3.01    0.808      4.3       3.4      18.0    1.40      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random1_pscorefull.csv", replace
file nsw_all_random1_pscorefull.csv saved

. 
. import delimited "nsw_all_random2.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3156.51283   3192.63067   803.308262     3.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age Education Black Hispanic Married Nodegree, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816   25.497      4.5    58.2 |   0.43  0.670 |  0.98
                          |                                  |               |
Education              U  | 10.346   10.088     14.1         |   1.50  0.135 |  1.55*
                       M  | 10.346   10.303      2.4    83.2 |   0.21  0.832 |  1.13
                          |                                  |               |
Black                  U  | .84324   .82692      4.4         |   0.45  0.649 |     .
                       M  | .84324   .87568     -8.7   -98.7 |  -0.90  0.371 |     .
                          |                                  |               |
Hispanic               U  | .05946   .10769    -17.5         |  -1.78  0.076 |     .
                       M  | .05946   .06486     -2.0    88.8 |  -0.21  0.830 |     .
                          |                                  |               |
Married                U  | .18919   .15385      9.4         |   0.98  0.327 |     .
                       M  | .18919   .21622     -7.2    23.5 |  -0.65  0.519 |     .
                          |                                  |               |
Nodegree               U  | .70811   .83462    -30.4         |  -3.22  0.001 |     .
                       M  | .70811    .7027      1.3    95.7 |   0.11  0.910 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.024     14.79    0.022     14.4      12.4      37.2*   1.11     50
 Matched   | 0.006      3.01    0.808      4.3       3.4      18.0    1.40      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random2_pscorefull.csv", replace
file nsw_all_random2_pscorefull.csv saved

. 
. import delimited "nsw_all_random3.csv", case(preserve) clear
(10 vars, 445 obs)

. psmatch2 Treated Age Education Black Hispanic Married Nodegree, outcome(RE78) logit

Logistic regression                               Number of obs   =        445
                                                  LR chi2(6)      =      14.77
                                                  Prob > chi2     =     0.0221
Log likelihood = -294.71464                       Pseudo R2       =     0.0244

------------------------------------------------------------------------------
     Treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Age |   .0059171   .0142668     0.41   0.678    -.0220452    .0338794
   Education |  -.0639597    .071354    -0.90   0.370     -.203811    .0758916
       Black |  -.2543689   .3639735    -0.70   0.485    -.9677438    .4590061
    Hispanic |  -.8291587   .5042305    -1.64   0.100    -1.817432     .159115
     Married |   .2342415   .2661824     0.88   0.379    -.2874665    .7559495
    Nodegree |  -.8385524   .3093833    -2.71   0.007    -1.444933   -.2321722
       _cons |   1.053028   1.047384     1.01   0.315    -.9998064    3.105862
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched |  6349.1435   4554.80112   1794.34238   632.853392     2.84
                        ATT |  6349.1435   3306.96557   3042.17793   808.067411     3.76
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       260 |       260 
   Treated |       185 |       185 
-----------+-----------+----------
     Total |       445 |       445 


. pstest Age Education Black Hispanic Married Nodegree, summary both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
Age                    U  | 25.816   25.054     10.7         |   1.12  0.265 |  1.03
                       M  | 25.816   25.497      4.5    58.2 |   0.43  0.670 |  0.98
                          |                                  |               |
Education              U  | 10.346   10.088     14.1         |   1.50  0.135 |  1.55*
                       M  | 10.346   10.303      2.4    83.2 |   0.21  0.832 |  1.13
                          |                                  |               |
Black                  U  | .84324   .82692      4.4         |   0.45  0.649 |     .
                       M  | .84324   .87568     -8.7   -98.7 |  -0.90  0.371 |     .
                          |                                  |               |
Hispanic               U  | .05946   .10769    -17.5         |  -1.78  0.076 |     .
                       M  | .05946   .06486     -2.0    88.8 |  -0.21  0.830 |     .
                          |                                  |               |
Married                U  | .18919   .15385      9.4         |   0.98  0.327 |     .
                       M  | .18919   .21622     -7.2    23.5 |  -0.65  0.519 |     .
                          |                                  |               |
Nodegree               U  | .70811   .83462    -30.4         |  -3.22  0.001 |     .
                       M  | .70811    .7027      1.3    95.7 |   0.11  0.910 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.75; 1.34] for U and [0.75; 1.34] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.024     14.79    0.022     14.4      12.4      37.2*   1.11     50
 Matched   | 0.006      3.01    0.808      4.3       3.4      18.0    1.40      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. export delimited using "nsw_all_random3_pscorefull.csv", replace
file nsw_all_random3_pscorefull.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  M:\Blackman\PropensityScoreMatching\PropensityScoreMatching\tests\results\all_results.log
  log type:  text
 closed on:   4 Dec 2015, 13:25:11
----------------------------------------------------------------------------------------------------------------------------------
